import React from "react";
import { Link } from "react-router-dom";

const About = () => {
  return (
    <section className="p-4 lg:p-8 bg-gradient-to-r from-indigo-500 to-blue-500  text-gray-900">
      <div className="container mx-auto space-y-12">
        <div className="flex flex-col overflow-hidden rounded-md shadow-sm lg:flex-row">
          {/* <img
            src="https://ibb.co.com/gT773yf"
            alt=""
            className="h-80  bg-gray-500 aspect-video lg:hidden"
                      /> */}
          <div className="flex flex-col justify-center flex-1 p-6 bg-gray-50">
            <span className="text-xs uppercase text-gray-600"> </span>
            <h3 className="text-3xl font-bold">
              Institute of Computer Science & Technology (ICST)
            </h3>

            <p className="my-6 text-gray-600">
              ৪ বছর মেয়াদী ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং কোর্সে ২৪ তম ব্যাচে সরকারি
              বৃত্তির সুবিধাসহ ভর্তি চলছে।
              <br />
              🟩 টেকনোলজি সমূহঃ <br />
              🔵 কম্পিউটার সায়েন্স এন্ড টেকনোলজি <br />
              🔵 সিভিল টেকনোলজি <br />
              🔵 ইলেকট্রিক্যাল টেকনোলজি <br />
              🔵 ইলেকট্রনিক্স টেকনোলজি <br />
              🔵 আর্কিটেকচার টেকনোলজি <br />
              🔵 টেক্সটাইল টেকনোলজি <br />
              🔵 গার্মেন্টস টেকনোলজি
            </p>

            <p className="my-6 text-gray-600">
              🟩 ভর্তির যোগ্যতা: <br />
              🔴 এস.এস.সি/সমমান পরীক্ষায় যে কোন গ্রুপ (বিজ্ঞান, ব্যবসা এবং
              মানবিক) থেকে জিপিএ ২.০০ পেয়ে উত্তীর্ণ যে কোন সালের পাসকৃতরা ভর্তি
              হতে পারবেন। <br />
              🔴 HSC ভোকেশনাল উত্তীর্ণ শিক্ষার্থীরা ক্রেডিট ট্রান্সফারের মাধ্যমে
              শূন্য আসনে সরাসরি ৪র্থ পর্বে (4th semester) ভর্তি হওয়ার সুযোগ
              পাবে। <br />
              🔴 HSC বিজ্ঞান বিভাগ (উচ্চতর গনিত সহ) থেকে উত্তীর্ণ শূন্য আসনে
              সরাসরি ৩য় পর্বে ভর্তি হওয়ার সুযোগ পাবে।
            </p>

            <p className="my-6 text-gray-600">
              🟧 মেধাবী ছাত্র/ছাত্রীদের জন্য বিশেষ সুযোগ: <br />
              🔴 ছাত্রীদের বিশেষ ছাড়ে পড়ার সুযোগ! <br />
              🔴 ভর্তি বৃত্তি: ৩০০০/- যোগ্যতা: SSC তে কমপক্ষে GPA- 4.50 <br />
              🔴 উপস্থিতি বৃত্তি: ৫০০/- প্রতি পর্বে ক্লাসে কমপক্ষে ৯০% উপস্থিতি
              থাকলে এই বৃত্তির জন্য যোগ্য বলে বিবেচিত হবে। <br />
              🔴 মেধা বৃত্তি: ২০০০/- যোগ্যতা: ১ম -৭ম প্রতি পর্ব সমাপনী পরীক্ষায়
              কমপক্ষে GPA-3.60 <br />
              🔴 সরকারি বৃত্তি: প্রতি পর্বে (৬ মাস) ৪০০০/- টাকা।
            </p>

            <p className="my-6 text-gray-600">
              🟧 আমাদের অনন্য বৈশিষ্ট্যঃ <br />
              🟣 ICST বিশ্ব ব্যাংকের অনুদান (গ্র্যান্ড)প্রাপ্ত দেশের অন্যতম সেরা
              একটি বেসরকারি পলিটেকনিক ইনস্টিটিউট। <br />
              🟣 ICST রয়েছে নিজস্ব সু-বিশাল স্থায়ী ক্যাম্পাস। <br />
              🟣 সার্বক্ষণিক সিসি ক্যামেরা দ্বারা ক্লাস মনিটরিং করা হয়। <br />
              🟣 শিক্ষার্থীদের ক্লাসে নিয়মিত অংশগ্রহণ নিশ্চিত করার জন্য মনিটরিং
              সেল রয়েছে। <br />
              🟣 নিজস্ব হোস্টেলে ছাত্রদের থাকার সু-ব্যবস্থা। <br />
              🟣 বিশ্ব ব্যাংকের অর্থায়নে আধুনিক যন্ত্রপাতি সমৃদ্ধ ব্যবহারিক
              ল্যাব রয়েছে। <br />
              🟣 শিক্ষার্থীদের শিল্পকারখানা পরিদর্শনের সুযোগ রয়েছে। <br />
              🟣 টেকনোলজি ভিত্তিক গাইড শিক্ষক/শিক্ষিকা দ্বারা সহায়তা করা হয়।{" "}
              <br />
              🟣 দক্ষ ও প্রশিক্ষণপ্রাপ্ত স্থায়ী শিক্ষক মন্ডলী দ্বারা ক্লাস
              পরিচালিত। <br />
              🟣 ২০০১ সাল থেকে ডিপ্লোমা-ইন-ইঞ্জিনিয়ারিং কোর্স পরিচালনা করার
              দীর্ঘ অভিজ্ঞতা।
            </p>

            <p className="my-6 text-gray-600">
              👉 কোর্সের বৈশিষ্ট্য: <br />
              🟣 পাশের পর ঢাকা প্রকৌশল ও প্রযুক্তি বিশ্ববিদ্যালয়ে BSC
              ইঞ্জিনিয়ারিং পড়ার সুযোগ। <br />
              🟣 স্নাতক পর্যায়ে দেশে বিদেশে উচ্চতর ডিগ্রী নেওয়ার সুযোগ। <br />
              🟣 বাংলাদেশ কারিগরি শিক্ষাবোর্ড কর্তৃক ভর্তি রেজিস্ট্রেশন, চূড়ান্ত
              পরীক্ষা নিয়ন্ত্রণ। <br />
              🟣 সরকারি গেজেটেড র্কমর্কতা ও বেসরকারি ক্ষেত্রে পর্যাপ্ত সুযোগ।{" "}
              <br />
              🔶 চাকরির সুযোগ: <br />
              🔴 সরকারি প্রতিষ্ঠানে উপ-সহকারি প্রকৌশলী পদে চাকরির সুযোগ। <br />
              🔴 দেশে-বিদেশে মিল, কারখানায় চাকরির সুযোগ। <br />
              🔴 পানি উন্নয়ন বোর্ড, বিদ্যুৎ উন্নয়ন বোর্ডসহ বিভিন্ন সরকারি
              প্রতিষ্ঠানে চাকরির সুযোগ।
            </p>


            {/* <Link
              to="/apply"
              type="button"
              className="self-end btn btn-primary"
            >
              Apply Now
            </Link> */}
          </div>
        </div>
      </div>
    </section>
  );
};

export default About;
